Revit 2027 API
RebarUpdateCurvesData.GetStartConstraint Method
 Gets the current constraint for the start handle of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraint GetStartConstraint()
Public Function GetStartConstraint As RebarConstraint
public:
RebarConstraint^ GetStartConstraint()
member GetStartConstraint : unit -> RebarConstraint
Return Value
RebarConstraint
 Returns the current constraint for the start handle of the Rebar. Return value is null if no constraint is present.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace